# 여러줄 출력은 """ 3번사용하면 여러줄 출력이 가능
# 상단에 \를 넣으면 위쪽 공백이 사라짐.
print("""\
안녕 하세요
반갑습니다.
다음에 봐요.
안녕 하세요
반갑습니다.
다음에 봐요.\
""")



# print("안녕하세요. 저의 이름은 홍길동입니다.")
# print('안녕 하세요 저의 이름은 "홍길동"입니다')
# print("안녕 하세요. 저의 이른은 \"홍길동\"입니다.")
# print('안녕하세요. ')
# print("안녕하세요. 반갑습니다. 다음에 또 봐요.")
# # \ :출력때 줄바꿈 해줌. \t:tad키
# print("안녕 하세요.\n 반갑습니다. \n 다음에 또 봐요.")
# print("안녕 하세요 \t 반갑습니다. \t 다음에 또 봐요.")
      
# print("10+5=15")
# print("10+5={},10-5+{}".format(10+5,10-5))
# print(10,"+",5,"=",10+5,10,"-",5,"-",10-5)

      
    
      
#758.12345678 소수점 2자리 출력하시오.
print("{:.2f}".format(758.12345678))

# 25.05
print("{:010.2f}".format(25.05))

15

# 150.15
# print("정수:{},실수{},문자열{}".format(150.15))
# print("정수:%d,실수:%f,문자열:%s" % (150.15,150.15))
# #+,-,*,/,**(제곱)
# print(2**3) #2x2x2 =8
# print(3**3) #3x3x3 =27

# print("*"*10)