# # 기본 출력.
# # 하나만 출력 합니다.
# print("# 하나만 출력합니다.")
# print("Hello Python progranming...!")
# print()

# # 여러 개를 출력합니다.
# print("# 여러 개를 출력 합니다.")
# print(10,20,30,40,50)
# print("안녕하세요","저의","이름은","박영훈입니다!")
# print()

# # 아무것도 입력하지 않으면 단순하게 줄바꿈 합니다.
# print("# 아무것도 출력하지 않습니다.")
# print("--- 확인 박영훈---")
# print()
# print()
# print("--- 확인 박영훈---")

# # 이스케이프 문자(\t)로 탭 사용하기.
# print("이름\t나이\t지역")
# print("박영훈\t51\t관악구")
# print("이경화\t45\t관악구")
# print("박현준\t16\t관악구")
# print("박예진\t13\t관악구")

# 여러줄 문자열 만들기.
# print("동해물과 백두산이 마르고 닳도록\n하나님이 보우하사 우리나라 만세\n무궁화 삼천리 화려강산 대한사람\n대한으로 길이 보전 하세")
# print("""동해물과 백두산이 마르고 닳도록
# 하나님 이 보우하사 우리나라 만세
# 무궁화 삼천리 화려강산 대한사람 
# 길이 보전 하세""")

# 줄바꿈 없이 문자열 만들기.
# print("""
# 동해물과 백두산이 마르고 닳도록 
# 하나님이 보우하사 우리나라 만세 
# 무궁화 삼천리 화려강산 대한사람 
# 대한으로 길이 보전하세
# """)
# print("""\
# 동해물과 백두산이 마르고 닳도록 
# 하나님이 보우하사 우리나라 만세 
# 무궁화 삼천리 화려강산 대한사람 
# 대한으로 길이 보전하세\
# """)

# 문자 선택 연산자의 결과 출력 하기.
# print("문자 선택 연산자에 대해 알아볼까요?")
# print("안녕하세요"[0])
# print("안녕하세요"[1])
# print("안녕하세요"[2])
# print("안녕하세요"[3])
# print("안녕하세요"[4])
