# 뒤에서부터 선택하기.
# print("문자를 뒤에서부터 선택해 볼까요")
# print("안녕하세요"[-1])
# print("안녕하세요"[-2])
# print("안녕하세요"[-3])
# print("안녕하세요"[-4])
# print("안녕하세요"[-5])

# 문자열 범위 선택 연산자(슬라이싱):[:]
# print("안녕하세요"[1:4])
# print("안녕하세요"[0:2])
# print("안녕하세요"[1:3])
# print("안녕하세요"[2:4])
# print("안녕하세요"[1:])
# print("안녕하세요"[:3])

#IndexError(index out of range)예외.
# print("안녕하세요"[10])

#문자열의 길이 구하기.
# print(len("안녕하세요"))
# print(5)
# 5

# 소수점이 없는 숫자를 정수형 소수점이 있는 숫자를 실수형 이라 한다.
# .정수integer : 0.1.273.-52
# .실수(부동소수점)FloatingPoint : 0.0.52.273.-12

# 숫자의 종류.
# print(273)
# print(52.273)
# print(type(52))
# print(type(52.273))
# print(0)
# print(type(0))
# print(0.0)
# print(type(0.0))

# 파이썬에서의 자수 표현.
# print(0.52273e2)
# print(0.52273e-2)

# # 숫자연산자 , 사칙연산자:+,-,*,/

# print("5 + 7 =", 5 + 7)
# print("5 - 7 =", 5 -7)
# print("5 * 7 =", 5 * 7)
# print("5 / 7 =", 5 / 7)

# 정수 나누기 연산자://
# print("3 / 2 =", 3 / 2)
# print("3 // 2 =", 3 // 2)

# # 나머지 연산자:%
# print("5 % 2 =", 5 % 2)

# 제곱 연산자:**
# print("2 ** 1 =", 2 ** 1)
# print("2 ** 2 =", 2 ** 2)
# print("2 ** 3 =", 2 ** 3)
# print("2 ** 4 =", 2 ** 4)
